{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of20.bin", "group1-shard2of20.bin", "group1-shard3of20.bin", "group1-shard4of20.bin", "group1-shard5of20.bin", "group1-shard6of20.bin", "group1-shard7of20.bin", "group1-shard8of20.bin", "group1-shard9of20.bin", "group1-shard10of20.bin", "group1-shard11of20.bin", "group1-shard12of20.bin", "group1-shard13of20.bin", "group1-shard14of20.bin", "group1-shard15of20.bin", "group1-shard16of20.bin", "group1-shard17of20.bin", "group1-shard18of20.bin", "group1-shard19of20.bin", "group1-shard20of20.bin"], "weights": [{"name": "basenet.slice1.0/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "basenet.slice1.0/bias", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.1/gamma", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.1/beta", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "basenet.slice1.3/bias", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.4/gamma", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.4/beta", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.4/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.4/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "basenet.slice1.7/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "basenet.slice1.7/bias", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.8/gamma", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.8/beta", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.8/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.8/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.10/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "basenet.slice1.10/bias", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.11/gamma", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.11/beta", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.11/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice1.11/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "basenet.slice2.14/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "basenet.slice2.14/bias", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.15/gamma", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.15/beta", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.15/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.15/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.17/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "basenet.slice2.17/bias", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.18/gamma", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.18/beta", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.18/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice2.18/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice3.20/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "basenet.slice3.20/bias", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice3.21/gamma", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice3.21/beta", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice3.21/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice3.21/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "basenet.slice3.24/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "basenet.slice3.24/bias", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.25/gamma", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.25/beta", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.25/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.25/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.27/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "basenet.slice3.27/bias", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.28/gamma", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.28/beta", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.28/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice3.28/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.30/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "basenet.slice4.30/bias", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.31/gamma", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.31/beta", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.31/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.31/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.34/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "basenet.slice4.34/bias", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.35/gamma", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.35/beta", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.35/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.35/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.37/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "basenet.slice4.37/bias", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.38/gamma", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.38/beta", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.38/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice4.38/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "basenet.slice5.1/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "basenet.slice5.1/bias", "shape": [1024], "dtype": "float32"}, {"name": "basenet.slice5.2/kernel", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "basenet.slice5.2/bias", "shape": [1024], "dtype": "float32"}, {"name": "upconv1.conv.0/kernel", "shape": [1, 1, 1536, 512], "dtype": "float32"}, {"name": "upconv1.conv.0/bias", "shape": [512], "dtype": "float32"}, {"name": "upconv1.conv.1/gamma", "shape": [512], "dtype": "float32"}, {"name": "upconv1.conv.1/beta", "shape": [512], "dtype": "float32"}, {"name": "upconv1.conv.1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "upconv1.conv.1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "upconv1.conv.3/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "upconv1.conv.3/bias", "shape": [256], "dtype": "float32"}, {"name": "upconv1.conv.4/gamma", "shape": [256], "dtype": "float32"}, {"name": "upconv1.conv.4/beta", "shape": [256], "dtype": "float32"}, {"name": "upconv1.conv.4/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "upconv1.conv.4/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "upconv2.conv.0/kernel", "shape": [1, 1, 768, 256], "dtype": "float32"}, {"name": "upconv2.conv.0/bias", "shape": [256], "dtype": "float32"}, {"name": "upconv2.conv.1/gamma", "shape": [256], "dtype": "float32"}, {"name": "upconv2.conv.1/beta", "shape": [256], "dtype": "float32"}, {"name": "upconv2.conv.1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "upconv2.conv.1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "upconv2.conv.3/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "upconv2.conv.3/bias", "shape": [128], "dtype": "float32"}, {"name": "upconv2.conv.4/gamma", "shape": [128], "dtype": "float32"}, {"name": "upconv2.conv.4/beta", "shape": [128], "dtype": "float32"}, {"name": "upconv2.conv.4/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "upconv2.conv.4/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "upconv3.conv.0/kernel", "shape": [1, 1, 384, 128], "dtype": "float32"}, {"name": "upconv3.conv.0/bias", "shape": [128], "dtype": "float32"}, {"name": "upconv3.conv.1/gamma", "shape": [128], "dtype": "float32"}, {"name": "upconv3.conv.1/beta", "shape": [128], "dtype": "float32"}, {"name": "upconv3.conv.1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "upconv3.conv.1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "upconv3.conv.3/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "upconv3.conv.3/bias", "shape": [64], "dtype": "float32"}, {"name": "upconv3.conv.4/gamma", "shape": [64], "dtype": "float32"}, {"name": "upconv3.conv.4/beta", "shape": [64], "dtype": "float32"}, {"name": "upconv3.conv.4/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "upconv3.conv.4/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "upconv4.conv.0/kernel", "shape": [1, 1, 192, 64], "dtype": "float32"}, {"name": "upconv4.conv.0/bias", "shape": [64], "dtype": "float32"}, {"name": "upconv4.conv.1/gamma", "shape": [64], "dtype": "float32"}, {"name": "upconv4.conv.1/beta", "shape": [64], "dtype": "float32"}, {"name": "upconv4.conv.1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "upconv4.conv.1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "upconv4.conv.3/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "upconv4.conv.3/bias", "shape": [32], "dtype": "float32"}, {"name": "upconv4.conv.4/gamma", "shape": [32], "dtype": "float32"}, {"name": "upconv4.conv.4/beta", "shape": [32], "dtype": "float32"}, {"name": "upconv4.conv.4/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "upconv4.conv.4/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_cls.0/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv_cls.0/bias", "shape": [32], "dtype": "float32"}, {"name": "conv_cls.2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv_cls.2/bias", "shape": [32], "dtype": "float32"}, {"name": "conv_cls.4/kernel", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "conv_cls.4/bias", "shape": [16], "dtype": "float32"}, {"name": "conv_cls.6/kernel", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "conv_cls.6/bias", "shape": [16], "dtype": "float32"}, {"name": "conv_cls.8/kernel", "shape": [1, 1, 16, 2], "dtype": "float32"}, {"name": "conv_cls.8/bias", "shape": [2], "dtype": "float32"}]}]}